<h2>更新日志</h2>
<hr>
<p>在JNOJ的基础上，我校OJ开发组进行了如下更新</p>
<p>更新日志位置: /home/judge/jnoj/views/wiki/updatelog.php</p>
<p>[+]表示增添功能</p>
<p>[&]表示修改、完善功能</p>
<p>[- ]表示删除功能</p>
<hr>
<p>2021.08.02</p>
<p>[&] 修复了SPJ保存时不自动编译的问题</p>
<hr>
<p>2021.07.29 by scx</p>
<p>[+] 在Polygon系统中，显示Import Problem功能，增加了对从domjudge导出题目类型(.zip)的上传支持，也支持上传自行构建的zip题目压缩包</p>
<p>[- ] 删除了管理员后台的Import Problem接口，使Import Problem只在Polygon中显示，并且导入题目路径重定向至Polygon文件夹</p>
<hr>
<p>2021.07.28 by scx</p>
<p>[+] 提交程序时增加了C++11、C++14、C++17的编译选项</p>
<hr>
<p>2021.07.24 by scx</p>
<p>[+] 在Markdown编辑器中增加了上传PDF的功能，上传后自动在内容中追加打开PDF的超链接</p>
<hr>
<p>2021.02.17 by mhr</p>
<p>[&] 把Polygon verify data界面修好了，能够正常使用了</p>
<hr>
<p>2021.02.05 by mhr</p>
<p>[- ] 删除了之前的ELO计算方法</p> 
<p>[+] 添加了新的基于Codeforces的ELO计算方法</p>
<hr>
<p>2021.02.03 by mhr</p>
<p>[+] 在提交界面为每个提交添加了详细的在第几个测试数据错误</p>
<p>[+] 在提交详情添加了用户的rating颜色和返回状态颜色</p>
<p>[- ] 删掉中英文切换功能，有一些bug外加一些显示上的不匹配，默认为全英文</p>
<p>[&] 修改了计算rating方法,可以多次计算并且只要有提交就会计算（目前还有bug没有完全修复）</p>
<hr>
<p>2021.02.01 by mhr</p>
<p>[+] 把隐藏的polygon系统调出来了</p>
<p>[&] 进一步修改了CF赛制的榜单的显示，现在加上了每个题的分数了</p>
<hr>
<p>2021.01.31 by mhr</p>
<p>[&] 修改了管理员后台为比赛添加用户的SQL语句bug</p>
<p>[&] 修改了User view的rating设置</p>
<p>[&] 完善了rating的计算</p>
<hr>
<p>2021.01.29 by mhr</p>
<p>[+] 为单人赛制增添每道题不同的分值，并且可以前端设置。还可以设置每道题每分钟减多少分</p>
<p>[- ] 删除了单人模式下一血额外加分功能</p>
<p>[&] 修改了单人赛榜单先排名做题数的问题</p>
<p>[&] 修改了积分的算分算法</p>
<p>[&] 把user主界面的rating图调出来了</p>
